In [48]:
# 각 컬럼별로 unique()해서 고윳값을 뽑아내서 결측치를 제거해야 한다
# 그냥 평균값을 넣으면 곤란하다
# Series에 Object데이터 타입이 있어야 str속성을 사용할 수 있다

## [ 접근자 Accessor ]  
- Series/DataFrame의 데이터가 날짜시간(datatime), 문자열(object), 범주형(Category)등의 경우 데이터타입과 관련된 전용의 함수들을 사용할 수 있도록 해주는 속성  
- Series.str.문자열처리관련함수명()  
- Series.dt.날짜시간처리관련속성명

In [49]:
import pandas as pd

In [50]:
datas={'name':["홍 길동","이 나영","마 징가","배 토벤"],
        'age':[10,21,73,89],
        'reg_date':["2010/01/23","2020/11/8","1995/5/4","1987/12/24"]}
datas2=[['name',"홍 길동","이 나영","마 징가","배 토벤"],
        ['age',10,21,73,89],
        ['reg_date',"2010/01/23","2020/11/8","1995/5/4","1987/12/24"]]
# 리스트와 튜플을 가지고 DF를 만들때와
# 딕셔너리를 가지고 DF를 만들때의 차이점
# -> 딕셔너리는 키값이 열로 들어가서 세로로 만들어지고, 리스트는 한 줄이 한 행이 되어버린다
# -> 즉 딕셔너리는 세로로 들어감, 리스트는 가로로 들어감

In [51]:
# Dict => DataFrame
df1=pd.DataFrame(datas)
df1

   name  age    reg_date
0  홍 길동   10  2010/01/23
1  이 나영   21   2020/11/8
2  마 징가   73    1995/5/4
3  배 토벤   89  1987/12/24

In [52]:
# List => DataFrame
df2=pd.DataFrame(datas2)
df2

          0           1          2         3           4
0      name        홍 길동       이 나영      마 징가        배 토벤
1       age          10         21        73          89
2  reg_date  2010/01/23  2020/11/8  1995/5/4  1987/12/24

In [53]:
# 데이터의 전체 기본 정보 => info()
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      4 non-null      object
 1   age       4 non-null      int64
 2   reg_date  4 non-null      object
dtypes: int64(1), object(2)
memory usage: 224.0+ bytes

In [54]:
#최근 컴퓨터는 대부분 64비트이기 때문에 unit8 64비트로 작업
df1["age"]=df1["age"].astype("uint8")
df1["reg_date"]=df1["reg_date"].astype("datetime64[s]")

In [55]:
# "이 나영"만 빼기 => 성과 이름으로 분리
first_name, last_name=[],[]
for idx in range(df1["name"].shape[0]) :
    first_name.append(df1["name"][idx].split(" ")[0])
    last_name.append(df1["name"][idx].split(" ")[1])
    
print(first_name, last_name)
df1["first_name"]=first_name
df1["last_name"]=last_name
df1

['홍', '이', '마', '배'] ['길동', '나영', '징가', '토벤']

   name  age   reg_date first_name last_name
0  홍 길동   10 2010-01-23          홍        길동
1  이 나영   21 2020-11-08          이        나영
2  마 징가   73 1995-05-04          마        징가
3  배 토벤   89 1987-12-24          배        토벤

In [56]:
#split을 사용한 
parse_name=df1["name"].str.split(expand=True)

In [57]:
df1=df1.merge(parse_name,left_index=True,right_index=True)
df1.rename(columns={0:"first_name",1:"last_name"},inplace=True)
df1

   name  age   reg_date first_name last_name first_name last_name
0  홍 길동   10 2010-01-23          홍        길동          홍        길동
1  이 나영   21 2020-11-08          이        나영          이        나영
2  마 징가   73 1995-05-04          마        징가          마        징가
3  배 토벤   89 1987-12-24          배        토벤          배        토벤

In [58]:
pd.concat([df1,parse_name],axis=1) # axis로 방향지정을 해야한다

   name  age   reg_date first_name last_name first_name last_name  0   1
0  홍 길동   10 2010-01-23          홍        길동          홍        길동  홍  길동
1  이 나영   21 2020-11-08          이        나영          이        나영  이  나영
2  마 징가   73 1995-05-04          마        징가          마        징가  마  징가
3  배 토벤   89 1987-12-24          배        토벤          배        토벤  배  토벤

In [61]:
pd.concat([df2,parse_name]) # NaT : not a timestamp라는 뜻이다

          0           1          2         3           4
0      name        홍 길동       이 나영      마 징가        배 토벤
1       age          10         21        73          89
2  reg_date  2010/01/23  2020/11/8  1995/5/4  1987/12/24
0         홍          길동        NaN       NaN         NaN
1         이          나영        NaN       NaN         NaN
2         마          징가        NaN       NaN         NaN
3         배          토벤        NaN       NaN         NaN

In [63]:
df1=pd.DataFrame(datas)
df1

   name  age    reg_date
0  홍 길동   10  2010/01/23
1  이 나영   21   2020/11/8
2  마 징가   73    1995/5/4
3  배 토벤   89  1987/12/24

In [64]:
# ignore_index = True를 주어 연속된 인덱스로 추가할 수 있게 해준다

In [69]:
df1["reg_date"]=df1["reg_date"].astype("datetime64[s]")

In [71]:
yearSR = df1["reg_date"].dt.year

0    2010
1    2020
2    1995
3    1987
Name: reg_date, dtype: int32

In [73]:
monthSR = df1["reg_date"].dt.month

In [74]:
daySR = df1["reg_date"].dt.day

In [77]:
pd.concat([df1, yearSR,monthSR,daySR],axis=1) # dt는 Series가 datetime일 때

   name  age   reg_date  reg_date  reg_date  reg_date
0  홍 길동   10 2010-01-23      2010         1        23
1  이 나영   21 2020-11-08      2020        11         8
2  마 징가   73 1995-05-04      1995         5         4
3  배 토벤   89 1987-12-24      1987        12        24

In [78]:
# csv => 데이터와 데이터의 구분자
df1.to_csv("df1.csv",index=False)

In [79]:
df1.to_csv("df1.csv",index=False, header=False)

In [80]:
pd.read_csv("df1.csv", header=None)

      0   1           2
0  홍 길동  10  2010-01-23
1  이 나영  21  2020-11-08
2  마 징가  73  1995-05-04
3  배 토벤  89  1987-12-24